{
    "title": "Freelance projects (Oct 2022-present)",
    "entries": [
      {
        "project_title": "Automated SQL Script Generation for Cross-Platform Data Migration",
        "position": "Python Software Engineer, Illumina, Mechelen, Belgium",
        "duration": "July-Aug 2023",
        "achievements": [
          "Architected and Developed an ORM Mapper for dynamic ingestion of various file formats, automating the SQL script generation process for data migration.",
          "Designed and implemented a Python package encapsulating the entire data migration logic, further enhanced by Docker containerization for portability and ease of deployment.",
          "Conducted comprehensive testing of generated SQL scripts using mock PostgreSQL database tables, ensuring script accuracy and reliability."
        ],
        "responsibilities": [
          "Implemented thorough testing protocols to ensure the reliability of generated SQL scripts before distribution.",
          "Designed codebase for minimal input requirements.",
          "Parameterized key inputs to enable flexible deployment across various database instances (Dev, Integration, Prod)."
        ]
      },
      {
        "project_title": "Configurable Bioinformatics Pipeline for Event-Triggered Secondary Analysis of Sequencing Data Using Python and Docker",
        "position": "Python Software Engineer & Data Pipeline Architect, Illumina, Mechelen, Belgium",
        "duration": "April 2023 - Present",
        "achievements": [
          "Engineered a robust Python package, incorporating features such as advanced logging, exception handling, and automated testing, enhancing software reliability and maintainability.",
          "Implemented a Docker-based solution for the analysis process, facilitating seamless data exchange and enhancing the reproducibility and scalability.",
          "Developed a configurable multi-stage pipeline for secondary analysis, providing an intuitive user interface that abstracted the complexity of the underlying data pipeline."
        ],
        "responsibilities": [
          "Provided guidance on automation strategies, leveraging CLI tools and API calls to enhance interoperability between Illumina platforms ICA and Basespace.",
          "Orchestrated the interaction between various services through ORM mapping, creating a simplified interface that abstracted the complexity of the underlying systems.",
          "Implemented unit testing using pytest and implemented fail-safe mechanisms for robust error handling."
        ]
      },
      {
        "project_title": "Design and implement information retrieval methods using Natural language processing (NLP)",
        "position": "Machine Learning Engineer, IT Supply Quality, GSK Belgium",
        "duration": "Oct 2022-Feb 2023",
        "achievements": [
          "Refactored and simplified python codebase, adding features such as better handling of non-english emails, breaking emails into sentences, etc",
          "Improved performance of information retrieval by 20% on unseen test data"
        ],
        "responsibilities": [
          "Defined and clarified KPI’s to track model performance evolution",
          "Implemented a text preprocessing pipeline in Azure Databricks using spacy tokenization, Part of speech (POS) tagging",
          "Performed POC’s on how to improve NLP model performance using rule based techniques as well as named entity recognition (NER)",
          "Annotated data to train a custom NER, storing model artifacts on Azure blob"
        ]
      }
    ]
  }
  